-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 24, 2021 at 04:09 AM
-- Server version: 10.4.21-MariaDB
-- PHP Version: 7.3.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `findinternship`
--

-- --------------------------------------------------------

--
-- Table structure for table `internship`
--

CREATE TABLE `internship` (
  `internID` int(11) NOT NULL,
  `internName` varchar(64) NOT NULL,
  `internLocation` varchar(128) NOT NULL,
  `internPhone` varchar(10) NOT NULL,
  `internEmail` varchar(64) NOT NULL,
  `internOwner` varchar(64) NOT NULL,
  `internDesc` text NOT NULL,
  `internSubmited` timestamp NOT NULL DEFAULT current_timestamp(),
  `internClosed` timestamp NULL DEFAULT NULL,
  `internOpen` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `internship`
--

INSERT INTO `internship` (`internID`, `internName`, `internLocation`, `internPhone`, `internEmail`, `internOwner`, `internDesc`, `internSubmited`, `internClosed`, `internOpen`) VALUES
(1, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(2, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(3, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(4, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(5, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(6, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(7, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(8, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(9, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(10, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(11, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(12, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(13, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(14, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(15, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL),
(16, 'วิทยาลัยเทคนิคเชียงใหม่', '9 ถนนเวียงแก้ว ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200', '053217708', 'cmtc@cmtc.ac.th', 'นาย วัชรพงศ์ ฝั้นติ๊บ', 'วิทยาลัยเทคนิคเชียงใหม่ เป็นวิทยาลัยเทคนิคหนึ่งในสองแห่งของจังหวัดเชียงใหม่ สังกัดสำนักงานคณะกรรมการการอาชีวศึกษา กระทรวงศึกษาธิการ เปิดสอนในระดับประกาศนียบัตรวิชาชีพ และประกาศนียบัตรวิชาชีพชั้นสูง', '2021-12-16 07:42:09', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `report`
--

CREATE TABLE `report` (
  `reportID` int(8) NOT NULL,
  `reportTitle` varchar(128) NOT NULL,
  `reportOwner` int(8) NOT NULL,
  `reportDate` date NOT NULL,
  `reportContent` text NOT NULL,
  `reportImg` varchar(64) DEFAULT NULL,
  `reportCreate` timestamp NOT NULL DEFAULT current_timestamp(),
  `reportLastEdit` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `report`
--

INSERT INTO `report` (`reportID`, `reportTitle`, `reportOwner`, `reportDate`, `reportContent`, `reportImg`, `reportCreate`, `reportLastEdit`) VALUES
(3, 'Test', 2, '2021-12-16', 'TestDesc', NULL, '2021-12-17 03:14:42', '2021-12-17 10:57:21'),
(5, 'สวัสดีครับ', 1, '2222-12-12', '123\r\nHellowWorld', NULL, '2021-12-17 06:22:30', '2021-12-17 16:03:00'),
(7, 'สวัสดี', 1, '1222-12-12', '121212', NULL, '2021-12-17 06:36:30', '2021-12-17 13:36:30');

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `userID` int(8) NOT NULL,
  `userName` varchar(64) NOT NULL,
  `userFirstName` varchar(64) NOT NULL,
  `userLastName` varchar(64) NOT NULL,
  `userPassword` varchar(64) NOT NULL,
  `userRole` varchar(64) NOT NULL DEFAULT 'Member'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`userID`, `userName`, `userFirstName`, `userLastName`, `userPassword`, `userRole`) VALUES
(1, 'Admin', 'Admin', 'Admin', '1234', 'Admin'),
(2, '63309010017', 'Piyadanai', 'Charoenta', '1509966186411', 'Member');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `internship`
--
ALTER TABLE `internship`
  ADD PRIMARY KEY (`internID`);

--
-- Indexes for table `report`
--
ALTER TABLE `report`
  ADD PRIMARY KEY (`reportID`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`userID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `internship`
--
ALTER TABLE `internship`
  MODIFY `internID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `report`
--
ALTER TABLE `report`
  MODIFY `reportID` int(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `userID` int(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
